{"template":"__react_static_root__/src/Home","sharedHashesByProp":{},"data":{"words":[{"words":"Learning, Community, Empowering, Knowledge, Ability, Understanding, Fun, Finding Your Way, Being Kind, Getting Along, Travelling, Cooking, Gardening, Hunting and Gathering, Mapping, Lifelong Learning, Exploring"}],"posts":[{"body":"Here's the Body","layout":"blog","date":"2020-09-03T17:17:14.261Z","subTitle":"Another Blog Post","author":"Some Guy","thumbnail":"/uploads/dark_emo_band.jpg","slug":"another-blog-post"},{"body":"Welcome to the New and Improved Yukon Literacy Coalition website.  We are so pleased to launch our beautiful new website.  Thank you to Aaron Janke for his design and building work and to Lisa and Victoria for their dedication and hard work on the project.  We appreciate any feedback.  The Yukon Literacy Coalition, like everyone else, has been impacted by COVID19.  We are adapting our programming to make them safe for everyone.\n\nWe will be providing program updates on this site and on our Facebook page-Yukon Family Literacy Centre, or for more information call us at 668-6535.","testButton":"asfdsf","layout":"blog","date":"2020-08-27T22:03:54.827Z","subTitle":"Website Launch","author":"Lisa Young","link":"","linkText":"","thumbnail":"/uploads/dark_emo_band.jpg","slug":"website-launch"}],"events":[{"body":"\nThis is a long-winded description of the event! This is a long-winded description of the event! This is a long-winded description of the event! This is a long-winded description of the event! This is a long-winded description of the event! This is a long-winded description of the event! This is a long-winded description of the event! This is a long-winded description of the event! This is a long-winded description of the event! This is a long-winded description of the event! This is a long-winded description of the event! This is a long-winded\n\ndescription of the event! This is a long-winded description of the event! This is a long-winded description of the event! This is a long-winded description of the event! This is a long-winded description of the event! This is a long-winded description of the event! This is a long-winded description of the event! This is a long-winded description of the event! This is a long-winded description of the event! This is a long-winded description of the event!\n","layout":"event","date":"2020-12-09T20:08:08.461Z","subTitle":"Barbecue with EVERYBODY!!!!!!","images":[{"image":"/uploads/dark_emo_band.jpg"},{"image":"/uploads/dark_emo_band.jpg"},{"image":"/uploads/dark_emo_band.jpg"},{"image":"/uploads/dark_emo_band.jpg"}],"slug":"barbecue-with-everybody"}],"announcements":[{"body":"This is a bunch of text. This is a bunch of text. This is a bunch of text. This is a bunch of text. This is a bunch of text. This is a bunch of text. This is a bunch of text. This is a bunch of text. This is a bunch of text. This is a bunch of text. This is a bunch of text. This is a bunch of text. This is a bunch of text. This is a bunch of text. This is a bunch of text. This is a bunch of text. This is a bunch of text. This is a bunch of text. This is a bunch of text.","title":"This is an announcement","link":"http://www.google.com","displayAnnouncement":false}],"highlightedProjects":[{"body":"In the summer of 2020, the Yukon Literacy Coalition launched a youth entrepreneurship initiative that supports and offers opportunities and guidance to Yukon youth (12-18 years old) who want to work for themselves and with others. The Yukon Literacy Coalition assists with start-up costs, marketing, budgeting and anything else to help the youth succeed with their project.","name":"This is a highlighted Project","title":"Youth Financial Literacy","link":"","image":"/uploads/dark_emo_band.jpg"},{"body":"The Yukon Literacy Coalition in partnership with CAFN and Yukon College are working together to provide training and employment to CAFN citizens through innovative and creative programming.  Among other things the Yukon Literacy Coalition assisted in the development of a greenhouse/gardening program which is thriving in year three.  As well as providing lots of vegetables for the community many citizens have benefited from this work/training opportunity.","title":"Dän Tsʼänānän ","image":"/uploads/dark_emo_band.jpg"},{"body":"The Family Literacy Centre is now online! During COVID-19 the Family Literacy Centre staff are sharing their stories, crafts and learning opportunities on YouTube to continue supporting families while they are at home.","title":"Family Literacy","link":"https://www.youtube.com/channel/UCsoAKkydC9BSeKIXJTNwXGQ","linkText":"Our YouTube Channel","image":"/uploads/dark_emo_band.jpg"}]},"path":"/"}
