{"template":"__react_static_root__/src/Community","sharedHashesByProp":{},"data":{"initiatives":[{"body":"Our Community Literacy project works with community facilitators from Yukon communities to design and run unique literacy programs. Facilitators are trained how to design and create their specific programs and learn how to embed literacy and essential skills. This past year, a facilitator from Carcross offered a traditional medicine and planting program, a facilitator from Teslin offered a community carpentry program that made benches for their community, and facilitators from Mayo ran a food security program which provided the local daycare with a garden bed and planting supplies.","title":"Community Literacy Program","subTitle":"Embedding Literacy","link":"","linkText":"","images":[],"slug":"community-literacy-program"},{"body":"The Dän Dákeyi Uyenjì (That person knows our country) program is a 21-week skill development course to train CAFN citizens in interpretive guiding on traditional CAFN territory. The course, designed by Yukon University in consultation with leading experts in the commercial guiding field, provides wellness, non-formal learning (soft skills) and formal learning (hard skills) and seeks to bring in traditional knowledge and skills together with current best practices of the guiding industry. Trainees in Whitehorse during the winter of 2019 learned new skills and honed existing skills such as group management, interpretive guiding, avalanche safety, traditional tool making, cross country skiing, fat biking, ice-climbing, wilderness first aid, back-country safety, helicopter awareness and camp cooking.","title":"Dän Dákeyi Uyenjì","subTitle":"That Person Knows Our Country","slug":"dn-dkeyi-uyenj"},{"body":"The Yukon Literacy Coalition, Champagne Aishihik First Nations (CAFN), and Yukon College are working together on a 40-month project called Dän Tsʼänānän, which is a federally funded program designed to increase capacities and employment for CAFN citizens. The vision of the program is to deliver innovative and culturally appropriate programming that focuses on peoples' strengths and brings about positive change for at-risk citizens. The intention is to increase literacy and employment skills of CAFN youth and adults that are out of school, under-employed, or unemployed.","title":"Dän Tsʼänānän","subTitle":"Focusing on people's strengths","images":[{"image":"/uploads/dark_emo_band.jpg"},{"image":"/uploads/dark_emo_band.jpg"},{"image":"/uploads/yukon-news_orig.png"},{"image":"/uploads/ylc_budgeting_tool_screenshot.png"}],"slug":"dn-tsnnn"},{"body":"One of our program initiatives is a Greenhouse Workplace Training program. The 21-week program started in April of 2019 in the Village of Haines Junction, Yukon. It was designed to combine wellness, non-formal learning (soft skills) and formal learning (hard skills), with the operation of two commercial greenhouses.","title":"Greenhouse Workplace Training Program","subTitle":"Gardens in Haines Junction","link":"","slug":"greenhouse-workplace-training-program"},{"body":"We identified the need for a Yukon specific, youth-focused financial literacy training that met the unique circumstances and needs of our Yukon Youth. We provide youth with relevant information that allows them to learn, understand and develop the skills required to become more confident and informed about the decisions they make regarding personal finances and their futures. This approach allows us to meet our youth where they are at and tailor learning and skill development to the unique circumstances of specific youth, their communities and their stage in life. \n\nIn the summer of 2020, the Yukon Literacy Coalition launched a youth entrepreneurship initiative supporting and offering opportunities and guidance to Yukon youth (12-18 years old) who want to work for themselves. The Yukon Literacy Coalition helps with start-up costs, marketing, budgeting and anything else we can do to help the youth succeed.","title":"Youth Financial Literacy","subTitle":"Relevant Information and Skills","slug":"youth-financial-literacy"}],"aboutCommunity":{"body":"The Yukon Literacy Coalition works with multiple partners on community specific and Yukon wide programs and projects.  We embed Literacy and Essential skills in adult programs, learning foundation life skills while running greenhouses, being on the land, building small businesses, running a Photo Booth, engaging in a community cooking program and on and on; we even provide personal financial literacy training in all of the Yukon communities.","title":"Community Initiatives","subTitle":"What are community initiatives?"}},"path":"community"}
